## 데이터 로딩 및 전처리
print('데이터 로딩중!')
import pandas as pd
import numpy as np


df = pd.read_csv('~/yogi6/model_data/data_final.csv') # 데이터 불러오기
df = df[df['description_prep'].notnull()] # 전시설명 결측치 제거
df.drop('Unnamed: 0',axis=1, inplace=True) # 필요없는 컬럼 제거
df.reset_index(drop=True, inplace=True) # 인덱스 번호 초기화
df.drop_duplicates(inplace=True) # 중복값 제거
df.description_prep = df.description_prep.astype(str) # 데이터 프레임의 'description' 열의 값들을 str 형식으로 바꾸기
df = df[~df['description_prep'].str.contains('keyword1|keyword2')] #데이터 프레임의 'description' 열의 값 중 keyword1이나 keyword 2가 포함된 행은 삭제
df['description_prep'] = df['description_prep'].str.replace('[^ㄱ-ㅎㅏ-ㅣ가-힣]',' ',regex=True) #한글이 아니면 빈 문자열로 바꾸기
df = df.replace({'': np.nan}) #빈 문자열 NAN 값으로 바꾸기
df = df.replace(r'^\s*$', None, regex=True)
df.dropna(how='any', inplace=True) #NAN 이 있는 행은 삭제
df = df.reset_index (drop = True) #인덱스 차곡차곡


stopwords = pd.read_csv("https://raw.githubusercontent.com/yoonkt200/FastCampusDataset/master/korean_stopwords.txt").values.tolist() # 불용어 사전
exhi_stopwords = ['으로', '하다', '전시', '전시회', '레이','하고', '다양하다', '넘다', '들다', '에서', '되다', '같이', '가장', '기본', '요소', '알아보다', '춥다', '절대',
    '특성', '제의', '확장', '추구', '도르다', '되어다', '로서', '아우르다', '독특하다', '얻다', '뚜렷하다', '이고', '균일하다', '시키다', '하나', '최소', '보이다', '하지만', '모든', '뛰어넘다', '가지', '어느', '장르', '없다', '자신', '지만', '역시', '다른', '이기', '때문', '이다', '차별',
    '않다', '실제', '방식', '다루다', '같다', '자유롭다', '맞추다', '가로지르다', '거닐다', '분명하다', '그렇게',
    '우리', '새기다', '남다', '또는', '기능', '의하다', '따르다', '놓이다', '지속', '위해', '소재', '활용',
    '진정하다', '들이다', '각자', '재료', '통해', '새롭다', '개념', '결과', '바라보다', '이라는', '이르다',
    '단순하다', '아니다', '대한', '강렬하다', '수많다', '처럼', '살아가다', '돌라', '리즘', '겸비', '일리', '튜브', '취한',
    '순서', '손잡이', '스툴', '최소한', '장점', '얽매', '생장', '젝션', '오버', '스르', '강점', '리아', '방이', '주석', '오상',
    '재는', '자로', '최대한', '갈수록', '마다', '종종', '글꼴', '가려진', '대사', '미처', '풍요롭', '마침내', '어서', '구사', '달라', '저기',
    '거꾸로', '반추', '치하', '그다지', '여러가지', '출처', '정말', '참으로', '간과', '대개', '로만', '리기', '그로', '파이', '레미',
    '것임', '제각각', '달이', '서서히', '카테고리', '미터', '보시', '만약', '지금껏', '빼곡', '어찌', '양태', '시스', '극히', '나머지',
    '굳이', '한마디', '직전', '지경', '이르렀다', '르그', '여지', '매번', '문득', '깨달', '주요한', '부리', '세잔', '까닭', '듯이', '자칫',
    '심지어', '전념', '잡기', '미가', '우리네', '근간', '수십', '가도', '역사상', '활짝', '하리', '감당', '마음대로', '외연', '청대',
    '자처', '국한', '하자', '구석구석', '꿈틀', '복도', '안팎', '상관', '훌쩍', '점도', '대처', '부작', '시킴', '불과', '몇몇', '양달',
    '비중', '땡땡', '자락', '한쪽', '중요시', '일단', '가미', '주어', '무심코', '오방', '재창', '한가운데', '마디', '당면', '쓰기',
    '붙이', '시시각각', '새로이', '서서', '명사', '실로', '다가', '살피', '침잠', '자가', '한순간', '구나', '리좀', '온몸', '여기저기',
    '가슴속', '넣기', '버선', '대고', '즉각', '위함', '도의', '세운', '것일', '그날', '겹겹이', '두루', '대답', '그대', '숨기', 
    '찍기', '윤증', '전해', '편이', '이건', '보라', '갖가지', '얼마', '갑자기', '삭제', '수년', '수면', '일어난다', '취급', '북송',
    '동판', '점점', '상감', '일원', '등등', '전부', '풀이', '날실', '상가', '가의', '소위', '후의', '마냥', '산다', '로지', '잠깐',
    '대체로', '빌어', '저변', '조차', '진단', '윈도우', '바구니', '습득', '감히', '와중', '정작', '무슨', '재고',
    '의외', '부위', '가감', '첨벙', '뒷모습', '우뚝', '일부분', '엮어', '피상', '지우개', '간주', '좌표', '일어나고',
    '일방', '일체', '층층', '천이', '스트', '지대', '고안', '송이', '희망이', '소의', '카르', '중추', '만듭니',
    '따위', '고산', '저장', '서든', '실수', '쓸모', '이음', '지기', '더욱더', '시어', '현주소',
    '실어', '특질', '밑거름', '기저', '대판', '푸르른', '미시', '발라', '다채롭', '여느',
    '수백', '변치', '햇취', '예나', '아예', '선묘', '상과', '도중', '거슬러', '걸이', '중기',
    '이지', '무하', '보더', '돌이', '려고', '내지', '지로', '클레', '라며', '약간', '쉽사리',
    '상적', '치기', '남지', '구가', '스레', '육필', '금박', '전서', '예서', '진행중', '발짝', 
    '판이', '덩이', '박지', '장동', '음으로', '불쑥', '저편', '진행', '주한', '보그', '당일', '오픈', '추가', '익스', '프리', '내용', '헬로', '오시', '주차', '안내', '전시기획자', '마지막',
    '확산', '날인', '사전', '준비', '종료', '일시', '링크', '선착순', '접수', '증정', '이벤트', '한해', '경품', '코드', '티켓', '완료',
    '조기', '대거', '동안', '빈티', '랜드', '운영', '시설', '베이', '향상', '상품', '해당', '전입', '문의', '기간', '당첨', '공지', '작성',
    '업로드', '불가', '바로가기', '인근', '인과', '개장', '연간', '방문', '비용', '대여', '방문객', '재개', '로스', '만들기', '일정',
    '이하', '보호자', '동반', '중복', '참가', '별도', '드릴', '신청', '참고', '사항', '입장', '하차', '상시', '가능',
    '각지', '가입', '발권', '예매', '입구', '미리', '기지', '기념품', '참석', '인증', '유의사항', '수령', '사전예약',
    '인원', '방지', '방역', '지침', '양해', '협조', '부탁', '개월', '미만', '할인', '학생증', '상임', '증빙', '반드시',
    '필수', '검색', '번호', '시행', '매표', '고객', '알림', '대중교통', '날짜', '평일', '제외', '변동', '변경', '받침',
    '도록', '두기', '시연', '편집장', '추첨', '개요', '모집', '총괄', '총감독', '구매', '입장권', '발급', '분실',
    '재발', '신분증', '개막', '본부', '추후', '세부', '지난해', '밀집', '가격', '소요', '요금', '업무', '사정', '취소',
    '착용', '수령', '협찬', '배달', '로그', '겸임', '일인', '연장', '모빌', '정이', '근무', '보도', '클릭', '연락',
    '설날', '공휴일', '혜택', '상해', '상전', '양구', '발행', '연락처', '유료', '솜씨', '매달', '매장', '주차장',
    '페인트', '판매', '휴무', '입장료', '시반', '만원', '출판물', '북스', '국문', '스토어', '수여', '후보', '응답',
    '직원', '연령', '관계자', '내외', '증진', '환불', '권종', '차액', '결제', '초대권', '아시', '이재', '기금',
    '마이', '이즈', '일자', '매월', '우대', '시시', '소지', '출입', '음식물', '전자', '등급', '쿠폰', '제출',
    '유의', '반입', '동일', '금액', '지불', '가기', '미정', '진열', '중단', '오니', '실시', '상세', '현역', '장터',
    '체크', '달력', '이내', '심사정', '구간', '수호', '매표소', '스티', '인솔', '권장', '향후', '로비', '명과',
    '고승', '주중', '만세', '상회', '브라', '살이', '뮤제', '출구', '첫째', '둘째', '넷째', '전액', '신고', '등지',
    '지오', '한시', '건너', '테로', '피아', '섭문', '대강', '공용', '주리', '호선', '도보', '동쪽', '남쪽', '그람',
    '규철', '사사', '번지', '교체', '수익금', '일월', '자도', '시원', '신미', '손글씨', '서긍', '호로', '원더',
    '등부', '지부', '주차공간', '브리', '이력', '톡톡', '우르', '사발', '가나다순', '근처', '상주', '내내', '지름',
    '정직', '사이드', '유려', '구호', '출범', '명실', '병인', '주소', '시로', '수다', '취득', '부와', '여종',
    '표본', '사지', '현황', '덕분', '서소문', '비아', '회차', '목록', '학년', '고의', '오백', '비구', '선잠', '종근당',
    '으뜸', '회당', '다자', '대상자', '여부', '직후', '모시', '넓이', '윤기', '고사', '오신', '박부', '명단', '패스',
    '떰떰', '강당', '사마', '전일', '시간표', '번은', '증명서', '스토', '손소독제', '발열', '비고', '명부', '나스',
    '종기', '다운로드', '디어', '지법', '화중', '언해', '함초롬바탕', '명조', '한컴', '위생용품', '용목', 
    '네오', '수프', '칭하', '경하', '결부', '종대', '주물', '간섭', '여럿', '만족도', '데크', '스캔', '설문조사',
    '로우', '수려', '비틀', '자동', '입력', '아마', '가동', '재사용', '점진', '투입', '표지판', '알갱이', '폰트',
    '도판', '과슈', '어원', '편집자', '함유', '평이', '관여', '어휘', '능가', '이용자', '와이어', '식이', '아홉',
    '변기', '연속성', '게재', '빨래', '당장', '미러', '갈라', '메모', '품질', '장발', '소상', '강소', '간혹',
    '타입', '검토', '나누기', '화장실', '예시', '구비', '웨어', '세번', '좀더', '이보', '리브', '감회', '단숨',
    '음성', '디지털로', '노닐', '페이스', '스킨', '가파른', '흠뻑', '명도', '산화', '용의', '마구', '성용', '덕목',
    '온통', '품목', '부담', '편리', '상큼', '몰래', '유유', '정심', '재적', '주안', '척도', '거론', '남용',
    '선형', '병렬', '경도', '설탕', '더욱이', '애초', '이마', '진자', '봉지', '다해', '억지로', '싸인', '방면',
    '모양새', '입술', '원통', '먹기', '투르', '텔러', '구한', '몸소', '직설', '색실', '박아', '모이', '뭔가',
    '구경', '푸코', '타진', '걷기', '듣기', '판재', '기조', '몸살', '빈번', '일차', '불사', '만년', '종일', 
    '대호', '근거지', '흉배', '흥분', '산도', '압력', '요충지', '나선', '얼핏', '모노', '천만', '각별', '양감',
    '벌써', '일일이', '불리', '비탈길', '상정', '방점', '강약', '목도', '거세', '볼풀', '저절로', '분산', '현수막',
    '투시', '내적인', '옹호', '실과', '니스', '지정학적', '대다수', '표암', '난무', '수지', '구성요소', '꼬리',
    '마트', '바디', '제각기', '강행', '불확정성', '비결정', '가림', '촘촘', '생김새', '외출', '상서', '골짜기',
    '하이퍼', '매몰', '대목', '이질', '강도', '가람', '알맹이', '설계도', '잘못', '방울', '밧줄', '래서', '초조',
    '취해', '무거', '상대방', '가식', '문턱', '언뜻', '씨실', '불연속', '신들', '통속', '상환', '구루', '구림',
    '사고력', '번짐', '포진', '생경', '포한', '자고', '이제야', '프라', '인류세', '소화', '버티고', '조치',
    '완화', '나날이', '줄곧', '요령', '비일', '가성', '상충', '유독', '행간', '각심', '지류', '글씨체', '갱신',
    '연출가', '선맥', '이목', '문법', '완벽', '완전', '정돈', '안명', '사다리', '로라', '기선', '끼리', '기세',
    '차별성', '견해', '세시', '결말', '타래', '오차', '단아', '돌출', '새삼', '다한', '빼기', '뚜렷', '태범',
    '이제껏', '차도', '하하', '부디', '체득', '치중', '무더기', '입김', '발아', '심각', '방편', '수공', '자석',
    '접착제', '스무', '게다가', '적막', '그윽', '무성', '영차', '공통분모', '시구', '처지', '차고', '과시',
    '관절', '철판', '혼용', '루지', '쿤스', '카림', '시드', '오노', '카시', '야시', '달무지개', '대일', '뒷받침',
    '효연', '삼은', '눈빛', '최적', '이반', '스리', '치명', '들뢰즈', '가위', '결구', '유보', '부수', '소스',
    '박승', '가해', '치면', '가령', '어간', '자장', '부들', '여실히', '다색', '포지션', '습성', '발음', '비늘',
    '보르', '빗살', '안목', '경유', '건칠', '수조', '이해해', '장롱', '절박', '처방', '세련', '생산력', '라마',
    '로티', '오수', '글귀', '물상', '격차', '폐쇄적', '주일', '르뽀', '색연필', '합류', '별개', '토마', '정정',
    '망막', '고고', '배동', '장대', '부속', '수직선', '주전자', '통유', '상존', '안경수', '주조', '파충류', '지갑',
    '돌파', '도료', '응어리', '포름', '잎사귀', '만하', '성유', '기계로', '바니', '온라인과', '휴대', '명령',
    '디지털화', '소이', '광원', '다리미', '어로', '중정', '토큰', '나날', '면세', '고가', '안방', '자존감',
    '신상', '한진', '체력', '증강', '서나', '정례', '뿜어져', '갖은', '제법', '양서면', '양방언', '더시티', 
    '고재', '슝슝', '두뇌', '가노', '괄호', '장법', '요컨대', '필자', '등잔', '폐품', '승은', '숙희', '담장',
    '불온', '끝내', '감정이입', '촉진', '치장', '로간', '회피', '일루', '전희', '되풀이', '당초', '도해', '필법',
    '포즈', '기하', '장악', '년경', '열한', '외적인', '횡단하', '살짝', '기미', '조롱', '길거리', '산책로',
    '두루마기', '배색', '속담', '찬장', '급속도', '숙연', '일명', '양으로', '니트', '구덩이', '산책길', '고이',
    '무지', '호호', '전락', '하드웨어', '증발', '수증기', '응집', '애나', '나중', '보색', '대열', '한장', '석회',
    '초크', '우의', '니드', '금계', '발톱', '결론', '토인', '통방', '클로즈업', '색면', '프린티드', '서랍', '신정',
    '상투', '고향이', '산야', '인세', '자루', '물위', '찬탄', '슬로', '각의', '탄성', '숨소리', '넝쿨', '파급',
    '고발', '운용', '안이', '다소간', '굽이', '맹지', '철근', '미리내', '꼭두', '겨를', '서면', '무언', '꿈결',
    '체인', '호피', '칠보', '쿠라', '꽃처럼', '분양', '절기', '날일', '파니', '피로', '괴짜', '혹시', '아스카',
    '천도', '제문', '물가', '앵글', '가마솥', '테디베어', '완숙', '설위', '영영', '발발', '소문', '가닥', '인견',
    '한치', '틈틈이', '모터', '유리잔', '봉안', '도설', '몸체', '스펀지', '공덕', '묘법', '붓끝', '진위',
    '육안', '돌기', '마하', '데리', '정성껏', '일견', '투각', '불현듯', '사슬', '자음', '리트', '무너', '에칭',
    '변질', '회통', '오자', '한창', '전축', '귀퉁이', '화판', '시오', '초성', '지학', '살라', '정황', '문제점',
    '관련성', '장정', '헝겊', '포섭', '수치', '대기실', '리슨', '송시', '어미', '삽입', '부록', '재원', '여닫이',
    '뒤편', '절세', '짊어지', '유예', '승인', '수신', '기입', '모니터링', '회랑', '너른', '비감', '카메',
    '영정', '삼부작', '비조', '부근', '날짜변경선', '저먼', '아가', '오즈', '로테', '니거', '생팔', '참상', '서역',
    '시런', '미달', '남분', '호구', '패랭이', '결합체', '마이티', '소비재', '생산자', '레진', '구조체', '비견', '마스', '특화된', '대본', '리터', '거주지', '연한', '고하',
    '항목', '리가', '문의사항', '기별', '원적', '표준화', '심미성', '통칭', '시류', '고충', '어감', '초과',
    '그램', '스텝', '삼지', '전령', '기온', '내의', '전달자', '소명', '정렬', '구의', '간구', '행태', '세탁',
    '융화', '요일', '손색', '제조업', '예선', '모더니', '탈의', '해법', '보태', '범접', '모드', '유효', '일력',
    '쉬이', '스텀', '장마당', '데무', '복의', '디테', '포용', '야만', '설치미술가', '가교', '직할', '여권', '양도',
    '브랜딩', '다발', '전만', '출시', '유감', '영수증', '코트', '닮음', '현안', '정가', '전송', '신예', '키치',
    '필체', '돌연', '부쿠', '레터', '샹들리', '낙관', '퇴색', '초생', '평민', '마는', '자투리', '나가야', '반경',
    '총칭', '착색', '굴절', '슬럼', '왁스', '방인', '누금', '성쇠', '여과', '감고', '터득', '무궁', '극치', '녹슨',
    '포화', '검증', '나로', '상응', '생산품', '선풍기', '흐릿하', '얼개', '임선', '물든', '복사', '상일', '젯소',
    '도포', '양파', '절의', '면목', '별처럼', '숙성', '차림', '맘껏', '해갈', '상문', '생인', '일찍', '뜻밖',
    '고심', '타르', '질곡', '좀처럼', '자원부', '오기', '공이', '와당', '서안', '동일시', '특이', '형용사',
    '기보', '변곡점', '호황', '몰이', '순덕', '아교', '전날', '해상도', '위축', '기틀', '도법', '적임', '누락',
    '게으름', '이국', '태운', '일률', '여파', '짜임', '민국', '필로', '기제', '간다라', '모필', '실재감', '정량',
    '묘미', '제철', '이점', '몰두', '뱃지', '예년', '촉구', '유체', '띤다', '십여', '번쩍', '클립', '함부로', '서남',
    '격랑', '는가', '막론', '유심', '도대체', '러시', '개창', '애용', '날로', '나본', '엮다', '배접', '종래',
    '노이즈', '증대', '사뭇', '단추', '정념', '귀속', '체현', '기표', '바라봄', '호스', '동완', '열거', '범람',
    '청바지', '고금', '관할', '닥나무', '가쁘', '인칭', '점프', '표제', '푸둥', '훤히', '내뿜는', '타원형', 
    '묵상', '책속', '외피', '구축함', '결산', '부원', '덧칠', '가로등', '반짝임', '위시', '곳도', '양질', '좌혜선',
    '오늘이', '급부', '기질', '이항', '연표', '항적', '주창', '화란', '참선', '부감', '아야', '폴리', '부산물',
    '유용성', '다다', '감행', '르포', '노끈', '연고', '자양', '부용', '절절', '재활용품', '코디최', '저쪽',
    '성동', '복각', '한결', '집결', '종은', '동일성', '단산', '한영', '통섭', '주저', '폐선', '먹물', '두툼',
    '장파', '결점', '금방', '재차', '지루함', '용구', '해치', '성문', '심정', '포크', '소성', '존재성', '창밖',
    '배양', '축약', '바르게', '제례', '일동', '오스', '매스', '유동성', '분배', '반문', '상공간', '급증', '적응',
    '갈이', '실정', '개인화', '강수', '유기물', '스피커', '원류', '세인', '시발', '벽사', '대용', '원목',
    '시대유감', '복판', '비언', '미안', '외로', '리뉴얼', '성품', '순식간', '합집', '후자', '시화', '일부러',
    '심취', '나이테', '우진', '피하', '보탬', '빈도', '프라이', '약화', '편성', '권태', '정시', '거름', '자만',
    '상대성', '잔뜩', '상연', '비약', '침대', '립하', '구함', '슬로우', '농도', '발묵', '맞닥뜨리', '유닛',
    '가장자리', '피안', '태양열', '부연', '홍보물', '고로', '우린', '탈구', '실경', '작도', '표명', '성미',
    '카라', '고윤', '우무', '불통', '예스', '정겨운', '용천', '다다익선', '호퍼', '은연중', '명시', '토껌',
    '고대로', '촘촘하', '슬라이드', '바리데기', '분사', '빈틈', '스카프', '물씬', '다차원', '감촉', '주사',
    '옥상정원', '종군', '스트로', '활력소', '스크래치', '라보', '전문화', '존엄성', '금속성', '심신', '나위',
    '돌궐', '신애', '지목', '구들', '향교', '양지', '분포', '화엄', '열전', '점선', '시국', '의제', '말풍선',
    '괴리감', '무한정', '찬가', '사관', '삶속', '집집', '무연', '결의', '높낮이', '사철', '마대', '상추',
    '눈동자', '시소', '돌담', '낫다', '애착', '명말', '통달', '녀석', '더없이', '대략', '이모저모', '거니',
    '파울', '대접', '마중', '과언', '부모은중경', '소거', '비석', '노니', '일익', '방정', '양분', '잠사', 
    '전해질', '스테이', '인스톨레이션', '홍도', '세분', '아이즈', '황성', '각목', '선반', '문짝', '숙제',
    '오션', '무척', '날선', '평행', '가칭', '교대', '의성어', '의태어', '사보', '옹기종기', '법학', '충동',
    '부끄러움', '드보르', '눌리', '유물론', '전성', '채온', '화이자', '공교', '비우기', '향악', '쇼룸',
    '배회', '타라북스', '내방가사', '다년', '펑위', '입다', '찬미', '목하', '갈기', '부뚜막', '베작', '형구',
    '틴트', '부서', '위탁', '드럼통', '나목', '판넬', '무단', '범과', '먼데이', '꽃핀', '용담', '장고분',
    '소시', '갈수', '침엽수', '랍스터', '사가', '스코프', '상당수', '영민', '에어', '전병', '리틀', '피스', '미미', '워터', '마인드', '영화로',
    '유치', '설문', '응모', '가량', '콘셉트', '보조', '접근성', '미나', '동명', '책방', '나우', '이케아',
    '푸드', '참석자', '양산', '순위', '디스플레이', '시브', '가르시아', '발판', '가스', '메인', '기술자', '가스',
    '공항', '페이스북', '소규모', '팀랩', '연화', '진수', '유니폼', '변천사', '페스', '골든', '하의', '상위',
    '쇼핑', '견인', '비주', '머신', '이아', '수분', '리움', '예비', '담당자', '장만', '제적', '프로그래머',
    '실리콘', '밸리', '간행', '업계', '배포', '비영리', '공업', '주식회사', '종사', '자외선', '나인', '인력',
    '성복', '자격', '메카', '노미', '네이션', '질의', '스케', '이드', '권유', '최상', '히든', '비키', '공헌',
    '센스', '공인', '엽니', '운송', '데이', '기재', '넥스트', '재기', '창간', '호인', '장용', '제작자', '세미',
    '리미', '티드', '테라', '하이', '생으로', '오보이', '주문', '후진', '팔레', '확정', '영인본', '연말',
    '날레', '에리', '훈련', '촉잔', '가드닝', '면면', '마키', '후미', '터리', '대담', '내년', '우리동네',
    '경과', '일터', '더블', '후안', '마누', '오토', '서거', '봉제', '업체', '대명사', '인수', '성사', '야마',
    '호분', '카펫', '안장', '중문', '계로', '장학금', '예기', '타도', '외치', '우민', '추월', '후배', '노고',
    '마네', '성찬', '회정', '홍직', '일로', '관청', '애호', '파워', '무어', '요시', '악력', '경인', '고을',
    '우회', '타지', '지음', '신형', '알천', '선재', '선배', '재청', '발표회', '에듀', '남관', '소라', '기수',
    '도민', '다량', '말리', '대산', '생화', '열띤', '진용', '광산구', '촌로', '우성', '마침', '실장', '발탁',
    '토스트', '소담', '페리', '우석', '각회', '반달', '에바', '청산', '미란', '레이크', '부설', '주축', '의거',
    '시성', '자긍심', '직할시', '정재', '자승', '신문사', '임용', '파스', '각광', '홍어', '즈음', '서각', '강동',
    '행려', '세태', '그랜드', '양화', '발매', '연세', '땅당스', '네스', '주신', '절차', '향림', '체결', '단장',
    '예복', '명재', '명필', '일괄', '영도', '중략', '김시', '중고', '실기', '개설', '보설', '아미', '이병',
    '성작', '다지', '전진', '가가', '음력', '년전', '아이파크', '공로', '퍼포머', '볼트', '저작권', '박동',
    '이인', '하종', '유키', '시나', '유타', '입지', '뜰리', '필요성', '위고', '우림', '공보부', '장리',
    '궁시', '산문', '합동', '당인', '돕기', '미노', '의성', '피리', '모태', '호크', '철불', '선문', '매듭',
    '해이', '성화', '도미', '전공자', '도림', '문전', '토모', '아라리', '갈고', '건의', '작화', '조이', 
    '쇳물', '빠키', '샤키', '부족함', '서기', '기량', '쉐어', '여건', '쌈지', '유리상자', '야장', '북적',
    '맵핑', '국채', '보상', '행전', '계명', '송진', '박태', '토포', '피카', '차도구', '행차', '원증', '미스',
    '각계', '페이', '인트', '신장', '기정', '여타', '추이', '손수', '이득', '공함', '하서', '대수', '요코',
    '아부', '형주', '장석', '원장', '강종', '문갑', '호전', '토탈', '남농', '유시', '범어', '불전', '교유',
    '색색', '특별자치도', '수레', '강용', '소가', '셔틀', '임스', '리오', '릅전', '예인', '이창', '도리',
    '서경', '프리즈', '배지', '수첩', '수문', '헤스', '화봉', '대자', '문도', '이마동', '경교', '계정', '순이',
    '사방탁자', '찬탁', '상부', '유묵', '문상', '충직', '진작', '강경', '방화', '정향', '차곡차곡', '재임',
    '흥원', '선물가게', '금보', '분원', '산청', '요지', '하동', '작센', '선제후', '무조건', '반출', '지망',
    '자막', '아웃', '성비', '이분', '오른', '도나', '엄정', '정일', '티움', '수복', '청마', '유태', '황남',
    '이정', '세밀화', '오덕', '정비', '나훔', '양하', '위촉', '난정', '미련', '구곡', '이듬해', '일행',
    '원금', '예총', '현기증', '볼음도', '유창', '칩스', '순영', '팔찌', '재욱', '금년', '크래프트', '센트',
    '디아', '앤드', '영락', '자단', '대문', '장고', '사경', '진천', '이스터', '포코', '차로', '개시', '성대',
    '공제', '사군', '생회', '창달', '본체', '벨트', '보날', '갠더', '우포', '자사', '월동', '대대로', '원교',
    '소전', '슬릿', '손문', '영예', '지아', '나타', '돌방무덤', '완공', '호림', '박물', '마사', '궁체', 
    '킁와레예', '티나', '자티', '사바', '적외선', '쿠쿠', '피드미', '데스', '원산', '체투', '이언', '타오',
    '자총', '바토', '맥스', '투루판', '검진', '허가', '마마', '북원', '장국', '향파', '특심', '뷔유', '각장',
    '태행', '잡가', '앰비규', '오브', '주로', '사용', '주의', '타고', '일부', '의자', '시선', '매일', '제작', '대신', '단어', '구조',
    '매개', '다리', '각기', '개체', '기존', '시절', '접목', '필요', '합판', '각각', '일종', '중첩', '너머', '이자',
    '간의', '전달', '시스템', '대체', '어딘가', '용도', '여러', '사의', '가운데', '물건', '품세', '사건', '기반',
    '성과', '존재', '그것', '대해', '빛과', '서로', '혼자', '더욱', '오늘', '상황', '주목', '가득', '가능성', '워드',
    '설명', '적극', '또한', '로부터', '내부', '지니', '리지', '이름', '대하', '이용', '결과물', '내일', '관심', '양식',
    '해결', '모두', '아래', '확인', '페인', '등장', '깊이', '몰입', '자체', '결코', '재현', '본래', '반영', '요구',
    '적용', '일련', '지고', '가까이', '사람과', '형식', '제시', '수용', '스스로', '다음', '역할', '이해', '주체',
    '단지', '주도' , '연결', '다시', '처리', '유지', '부분', '고요한', '초점', '누구', '가시', '거나', '수행', '무언가',
    '라면', '진짜', '위로', '전개', '점점', '달리', '상의', '보기', '곳곳', '마치', '차용', '이처럼', '조건', '상자', '특정',
    '한편', '여기', '하나로', '질적', '포착', '먼저', '경우', '간다', '본인', '편집', '제목', '길이', '무엇', '물성', '계속',
    '높이', '마주', '자기', '로움', '개별', '이면', '이제', '만날', '잡고', '물이', '내포', '정도', '어제', '보고', '통한',
    '연관', '보이지', '종류', '바로', '얼마나', '선사', '당신', '그린', '아주', '나이', '그대로', '멀리', '거기', '구도', 
    '로써', '인터', '오직', '토대', '점차', '어디', '한번', '일이', '단위', '잠시', '크게', '본격', '만큼', '오히려',
    '장면', '자주', '때로는', '따라서', '부여', '조금', '보아', '고스', '가슴', '보이', '어쩌면', '면서', '가끔', '반면',
    '아무', '항상', '유리', '매우', '비로소', '남아', '화의', '전혀', '시한', '파악', '때론', '찰나', '거듭', '대로',
    '고자', '피어', '움직', '도달', '온갖', '후반', '유영', '분류', '이나', '언급', '장치', '정지', '불구', '보지', '간직',
    '장지', '누군가', '그냥', '양상', '두운', '지나', '타자', '가야', '화두', '해도', '담채', '가변', '언제', '먼지', '지대',
    '자개', '매트', '이번', '공개', '구성', '문화원', '제품', '주요', '주제', '다수', '주로', '주의', '이전', '요청', '향유', '소개',
    '위성', '연작', '비교', '테이블', '구상', '최대', '예전', '사의', '주년', '영향', '품세', '나볼', '재질', '메타',
    '케이', '미스터', '이후', '워드', '주관', '신진', '공모', '그룹', '이스', '지엄', '세기', '한자리', '정수',
    '리지', '조명', '전후', '바이', '자하', '분야', '여러분', '맞이', '조성', '도모', '아르', '규모', '지난', '포함',
    '확인', '페인', '한눈', '관련', '가든', '부터', '적용', '확대', '지희', '자료', '비롯', '부착', '부문',
    '지은', '도면', '패널', '용품', '배출', '처리', '결성', '지원', '초점', '김형', '본문', '프레', '전개',
    '스페이스', '프린트', '거의', '주간', '서체', '하나로', '트리', '최고', '강사', '소장', '월간', '회의', 
    '전용', '등록', '경우', '본인', '학과', '콘텐츠', '편집', '면모', '추천', '이브', '로랑', '정기', '보관',
    '정리', '시청', '육성', '진흥', '추진', '위상', '높이', '널리', '회원', '참조', '거주', '여덟', '핵심',
    '다섯', '별로', '만날', '실물', '집의', '가전', '조정', '일보', '박명', '알리', '에이', '카이', '자문',
    '여섯', '리스', '어스', '우수', '그동안', '어가', '수록', '그간', '중인', '조명하', '활성화', '체적',
    '인터', '중구', '전의', '핸드', '식기', '규어', '범주', '다카', '크게', '본격', '수상한', '간송', '전신',
    '지정', '취지', '미감', '자주', '가회', '각종', '입선', '대부분', '리다', '태그', '만난', '인전', '구입',
    '역량', '고양', '스티커', '수준', '목걸이', '후기', '브로', '도입', '기리', '중요성', '누리', '각국', 
    '자수', '차지', '섬유', '번의', '보유', '화의', '일대', '협의', '나들이', '아람', '우이', '버그', '가마',
    '차례', '귀걸이', '마크', '에르', '복식', '말씀', '선호', '비치', '아우라', '거듭', '접시', '항아리',
    '이어진', '앙리', '수리', '탁자', '보고서', '회전', '벽면', '채색', '의전', '누비', '도첩', '남서', '어깨',
    '글씨', '가죽', '바느질', '진기', '광역시', '이나', '주자', '사리', '저희', '코스', '부로', '종합', '확립',
    '단색', '최승', '마르', '라이', '실력', '서단', '서법', '코너', '대적', '담당', '정해', '블럭', '의의',
    '정희', '금호', '본관', '알록달록', '임시', '이규', '연혁', '역임', '단원', '안료', '필립', '유수', '중이',
    '서도', '비어', '전업', '주선', '김정', '정자', '손경', '신명', '은숙', '메르', '일한국', '수립', '이외',
    '트페', '토리', '제기', '히로', '북서', '계열', '로드', '서원', '전관', '열기', '위주', '무렵', '두리',
    '소마', '최선', '레이지', '나기', '자개', '유채', '중요', '추사', '매트', '대한국', '블록', '성숙', '허리띠',
    '베개', '범돈', '장엄', '화협', '브라우저', '리빙', '곡리', '수무', '소란', '본보기', '숙박', '소득', '법적', '헬멧', '대표이사', '단기', '오디너리',
    '발제', '홀수', '답변', '워치', '리쿠', '백선', '지미', '슈가', '유인', '예정자', '메뉴', '사우스', '영구',
    '포에버', '실습', '주얼', '브링크', '용법', '장내', '너프', '입점', '이노', '중소', '해링', '심천', '우한',
    '약칭', '루나', '순차', '스마라', '특화', '판로', '소감', '책임자', '산학', '어포', '레디', '크로스', '디스',
    '노닐다', '이랜드', '고함', '심층', '바지', '양적', '포니', '방방곡곡', '나래', '실무', '관내', '출동', '턴스',
    '일찍이', '소로', '번길', '서교', '완연', '쇼몽', '술회', '선기', '통틀어', '참견', '티스', '선유', '밤부',
    '일주', '장전', '개칭', '묵회', '연중', '크리', '담담', '상화', '웨이브', '승지', '계해', '우사', '별관',
    '임레', '점화', '디뮤', '의정', '빛내', '입증', '오케이', '항공권', '인품', '권한', '촉망', '포은', '샌드',
    '품관', '우양', '성황리', '면체', '훗날', '상뻬', '웅대', '소우', '타마', '한길', '지원이', '뉴트', '이포',
    '일요', '서호', '총회', '대림', '스푼', '리카', '엑스레이', '구부', '면전', '주전', '달성', '씨알', '오촌',
    '밤섬', '모토로', '무려', '첫날', '마음가짐', '가나다', '남짓', '수증', '제지', '전속', '예사', '삼척', '이애',
    '윈도', '수경', '박의', '침전', '지급', '백만', '전임', '계발', '시전', '실비', '요즈음', '진본', '지선', 
    '전등', '깜짝', '헤르', '조습', '터테', '대미', '후지', '룻뮤', '뮤셈', '기세계', '금번', '맛깔', '피싱',
    '보마', '횟수', '티셔츠', '중랑', '너울', '담빛', '감안', '우관', '물관', '가제', '피지', '한림', '본상',
    '번수', '초입', '시범', '문래', '삼절', '행초', '로트렉', '고희', '스클', '안내서', '플라잉', '테미', '철교',
    '리나', '노선', '채화', '모람', '헤드', '마나', '카나다', '침선', '보행', '위엔', '실내악', '족슨', '액세스',
    '공저', '리코', '제만', '보사', '막간', '협연', '난지도', '내려받기', '채점', '미연', '약산', '환승', '리리',
    '키르', '도스', '산아', '트랩', '연감', '정록', '빛담', '빨주노초파남보', '토요일', '일요일']

for word in exhi_stopwords:
    stopwords.append(word)
    
    
#!pip install konlpy

from tqdm import tqdm
import time
from konlpy.tag import Okt

print('토큰화 작업중!')
okt = Okt()

noun_list = []
for content in tqdm(df['description_prep']):
    tokenized_sentence = okt.nouns(content) # 토큰화
    tokenized_sentence = [x for x in tokenized_sentence if len(x)>1] #한글자 단어 제거
    tokenized_sentence = [x for x in tokenized_sentence if x not in stopwords]  # 불용어 제거
    noun_list.append(tokenized_sentence)
    
df['nouns'] = noun_list # 명사 칼럼 추가

cluster = pd.read_csv('~/yogi6/model_data/words.csv')
cluster['words'] = cluster['words'].str.replace('\n', ', ', regex=True)

def find_cluster(name):
    name2id = {}
    for i, c in enumerate(df['name_cat']):
        name2id[i] = c

    # id -> name dictionary 생성
    id2name = {}
    for i, c in name2id.items():
        id2name[c] = i

    # 검색할 전시명 id 추출 후 명사 리스트 가져오기
    idx = id2name[name]
    idx_nouns = df.loc[idx]['nouns']
    # idx_nouns = list(set(idx_nouns))

    cluster_list = []
    for i in range(0, 10):
        cluster_i = cluster.iloc[i]['words']
        cluster_list.append(cluster_i)

    keyword_count = []
    for i in range(0, 10):
        result_i = len([x for x in idx_nouns if x in cluster_list[i]])
        keyword_count.append(result_i)
    # maxindex = np.argmax(keyword_count)
    max_count = max(keyword_count)
    cluster_label = [i for i, v in enumerate(keyword_count) if v == max_count]


    return cluster_label


df['cluster'] = df['name_cat'].apply(lambda x: find_cluster(x)) # 클러스터링 결과 컬럼으로 추가
df['cluster_len'] = df['cluster'].apply(lambda x: len(x)) # 클러스터링 카테고리 개수 구하기
df.loc[df['cluster_len'] > 2, 'cluster'] = '기타' # 클러스터링이 안된 데이터는 기타로 구분 (클러스터링이 3개 이상으로 분류되면 '기타' 취급)
#df.drop(['cluster'], axis=1, inplace=True) # cluster 칼럼 제거

# 전시별 카테고리 분류 결과 저장하는 함수
def save_find_cluster():
    cltr = df[df['category']==0]
    cltr['temp'] = cltr['name_cat'].apply(lambda x: find_cluster(x))
    cltr['cluster_len'] = cltr['temp'].apply(lambda x: len(x))
    cltr.loc[cltr['cluster_len'] > 2, 'cluster'] = '기타'
    cltr['find_cluster_exhi'] = cltr['cluster'].apply(lambda x: x[0:])
    cltr.drop(['category', 'description_prep', 'temp'], axis=1, inplace=True)
    
    return cltr

## 카테고리 결과 저장한 최종 데이터프레임 생성
print("추천 결과 저장중!")
cltr = save_find_cluster()

## 최종 데이터프레임 저장
cltr.to_csv('~/yogi6/model_data/cluster.csv', encoding='utf-8-sig')
print("군집화 결과 저장 완료!")
#print(cltr)